meeting/agenda/2026/03-31.org
:PROPERTIES:
:ID:       D5BC7B87-E427-438E-ABEC-352D2E27AB25
:END:
#+title: QT4 CG Meeting 158 Agenda 2026-03-31
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 12:00EDT).

Note: Europe and North America are now both on daylight saving time. In North
America, this and following meetings will be at the “normal” time again, until
the autumn.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2026/03-24.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 31 March 2026.

The next meeting is planned for 7 April 2026.

** Review of open action items [0/8]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.
+ [ ] QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday
+ [ ] QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion
+ [ ] QT4CG-156-01: MK: add reference to data model in F&O 9.2
+ [ ] QT4CG-156-03: MK to revise PR #2516 in light of the comments. 
+ [ ] QT4CG-157-01: CG to consider the issue of such empty directories
+ [ ] QT4CG-157-02: CG to propose an editorial change to use the fos:notes construct for the Notes. Also relevant to #2546

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2470][#2470]]: 1310 Functions fn:regex and ?matching-substrings
+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2345][#2345]]: 2299 Expand pipeline to allow arrow expression in path expression
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2563][#2563]]: 2562 Empty fields in parts-of-dateTime result now absent
+ PR [[https://qt4cg.org/dashboard/#pr-2560][#2560]]: 2321 Make fn:trace and fn:message nondeterministic
+ PR [[https://qt4cg.org/dashboard/#pr-2555][#2555]]: 2215 Add "see also" links between functions
+ PR [[https://qt4cg.org/dashboard/#pr-2551][#2551]]: 2550 Shadow attributes in RelaxNG schema
+ PR [[https://qt4cg.org/dashboard/#pr-2545][#2545]]: 2544 Drop xsl:record-type/@extensible

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2526][#2526]]: Facets
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2325][#2325]]: Specify evaluation more tight and more formal to disallow unsane cases
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2252][#2252]]: Dynamic XPath Evaluation the functional way

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2559][#2559]]: 2549 Functional purity
+ PR [[https://qt4cg.org/dashboard/#pr-2558][#2558]]: 2556 errors for invisible-xml() and doc()
+ PR [[https://qt4cg.org/dashboard/#pr-2552][#2552]]: 540bis Add system-properties() function
+ PR [[https://qt4cg.org/dashboard/#pr-2533][#2533]]: 2528 Update RFC reference (7159 -> 8259) for JSON 
+ PR [[https://qt4cg.org/dashboard/#pr-2531][#2531]]: QT4CG-154-02 Revise rules for setting stylesheet parameters
+ PR [[https://qt4cg.org/dashboard/#pr-2516][#2516]]: 2433 JTree function: Discuss JNode identity more fully
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2559: 2549 Functional purity
:PROPERTIES:
:CUSTOM_ID: pr-2559
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2559][#2559]].
** PR #2558: 2556 errors for invisible-xml() and doc()
:PROPERTIES:
:CUSTOM_ID: pr-2558
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2558][#2558]].
** PR #2552: 540bis Add system-properties() function
:PROPERTIES:
:CUSTOM_ID: pr-2552
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2552][#2552]].
** PR #2533: 2528 Update RFC reference (7159 -> 8259) for JSON 
:PROPERTIES:
:CUSTOM_ID: pr-2533
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2533][#2533]].
** PR #2531: QT4CG-154-02 Revise rules for setting stylesheet parameters
:PROPERTIES:
:CUSTOM_ID: pr-2531
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2531][#2531]].
** PR #2516: 2433 JTree function: Discuss JNode identity more fully
:PROPERTIES:
:CUSTOM_ID: pr-2516
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2516][#2516]].
** PR #2019: 1776: XSLT template rules for maps and array
:PROPERTIES:
:CUSTOM_ID: pr-2019
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]].

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
