meeting/agenda/2026/03-31.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 158 Agenda 2026-03-31</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 158 Agenda 2026-03-31</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 12:00EDT).
</p>

<p>
Note: Europe and North America are now both on daylight saving time. In North
America, this and following meetings will be at the “normal” time again, until
the autumn.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2026/03-24.html">the previous meeting</a>.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 31 March 2026.
</p>

<p>
The next meeting is planned for 7 April 2026.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/8]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-01: MK: add reference to data model in F&amp;O 9.2</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-03: MK to revise PR #2516 in light of the comments.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-157-01: CG to consider the issue of such empty directories</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-157-02: CG to propose an editorial change to use the fos:notes construct for the Notes. Also relevant to #2546</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2470">#2470</a>: 1310 Functions fn:regex and ?matching-substrings</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2345">#2345</a>: 2299 Expand pipeline to allow arrow expression in path expression</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2563">#2563</a>: 2562 Empty fields in parts-of-dateTime result now absent</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2560">#2560</a>: 2321 Make fn:trace and fn:message nondeterministic</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2555">#2555</a>: 2215 Add "see also" links between functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2551">#2551</a>: 2550 Shadow attributes in RelaxNG schema</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2545">#2545</a>: 2544 Drop xsl:record-type/@extensible</li>
</ul>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2526">#2526</a>: Facets</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2325">#2325</a>: Specify evaluation more tight and more formal to disallow unsane cases</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2252">#2252</a>: Dynamic XPath Evaluation the functional way</li>
</ul>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2559">#2559</a>: 2549 Functional purity</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2558">#2558</a>: 2556 errors for invisible-xml() and doc()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2552">#2552</a>: 540bis Add system-properties() function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2533">#2533</a>: 2528 Update RFC reference (7159 -&gt; 8259) for JSON</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2531">#2531</a>: QT4CG-154-02 Revise rules for setting stylesheet parameters</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2516">#2516</a>: 2433 JTree function: Discuss JNode identity more fully</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.5.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2559" class="outline-3">
<h3 id="pr-2559"><span class="section-number-3">2.1.</span> PR #2559: 2549 Functional purity</h3>
<div class="outline-text-3" id="text-pr-2559">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2559">#2559</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2558" class="outline-3">
<h3 id="pr-2558"><span class="section-number-3">2.2.</span> PR #2558: 2556 errors for invisible-xml() and doc()</h3>
<div class="outline-text-3" id="text-pr-2558">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2558">#2558</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2552" class="outline-3">
<h3 id="pr-2552"><span class="section-number-3">2.3.</span> PR #2552: 540bis Add system-properties() function</h3>
<div class="outline-text-3" id="text-pr-2552">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2552">#2552</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2533" class="outline-3">
<h3 id="pr-2533"><span class="section-number-3">2.4.</span> PR #2533: 2528 Update RFC reference (7159 -&gt; 8259) for JSON</h3>
<div class="outline-text-3" id="text-pr-2533">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2533">#2533</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2531" class="outline-3">
<h3 id="pr-2531"><span class="section-number-3">2.5.</span> PR #2531: QT4CG-154-02 Revise rules for setting stylesheet parameters</h3>
<div class="outline-text-3" id="text-pr-2531">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2531">#2531</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2516" class="outline-3">
<h3 id="pr-2516"><span class="section-number-3">2.6.</span> PR #2516: 2433 JTree function: Discuss JNode identity more fully</h3>
<div class="outline-text-3" id="text-pr-2516">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2516">#2516</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2019" class="outline-3">
<h3 id="pr-2019"><span class="section-number-3">2.7.</span> PR #2019: 1776: XSLT template rules for maps and array</h3>
<div class="outline-text-3" id="text-pr-2019">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
